# Taps
tap "1password/tap"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"

# Developer tools
brew "coreutils"
brew "swiftlint"
brew "swift-format"
cask "1password-cli"
cask "db-browser-for-sqlite"
cask "dbvisualizer"
cask "launchcontrol"
cask "rstudio"
cask "sf-symbols"
cask "visual-studio-code"
mas "Apple Configurator", id: 1037126344

# Education
cask "anki"

# Essentials
brew "jq"
brew "mas"
brew "nano"
brew "tmux"
brew "wget"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "1password"
cask "alfred"
cask "brave-browser"
cask "cleanmymac"
cask "istat-menus"
mas "BetterSnapTool", id: 417375580

# Fun
brew "figlet"
brew "lolcat"
cask "bricklink-studio"
cask "plex"
cask "kindle"

# Languages and SDKs
brew "asciidoctor"
brew "bash"
brew "node"
brew "postgresql"
brew "python@3.9"
cask "flutter"
cask "r"

# Media
cask "vlc"
mas "Logic Pro", id: 634148309
mas "Pixelmator Pro", id: 1289583905

# Office
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Utilities
brew "csvkit"
brew "curl"
brew "exiftool"
brew "ffmpeg"
brew "pandoc"
brew "tesseract"
brew "tesseract-lang"
cask "4k-video-downloader"
cask "audacity"
cask "disk-drill"
cask "openaudible"
mas "AudioBookBinder", id: 413969927
mas "PDFOutliner", id: 420874236

# Unavailable
# Dorico 3.5.app
# NotePerformer
