tap "1password/tap"
tap "FelixKratz/formulae"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mas-cli/tap"
brew "asciidoctor"
brew "bash"
brew "coreutils"
brew "csvkit"
brew "dua-cli"
brew "exiftool"
brew "ffmpeg"
brew "firebase-cli"
brew "jq"
brew "latexindent" # Because VSCode can't see /Library/TeX/texbin/latexindent
brew "mas"
brew "nano"
brew "node"
brew "packer"
brew "pandoc"
brew "pdftk-java"
brew "postgresql"
brew "prettier"
brew "python3"
brew "rust"
brew "rust-analyzer"
brew "rustfmt"
brew "shellcheck"
brew "sketchybar"
brew "swift-format"
brew "swiftlint"
brew "tesseract"
brew "tesseract-lang"
brew "tmux"
brew "vsce"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "4k-video-downloaderplus"
cask "alfred"
cask "anki"
cask "audacity"
cask "blender"
cask "bugdom"
cask "cleanmymac"
cask "daisydisk"
cask "db-browser-for-sqlite"
cask "dbvisualizer"
cask "disk-drill"
cask "flutter"
cask "font-im-fell-english"
cask "google-chrome"
cask "google-cloud-sdk"
cask "istat-menus"
cask "launchcontrol"
cask "mactex" # Run `sudo tlmgr update --self` in new terminal after installing # Run `sudo tlmgr install comment` if missing comment.sty
cask "nanosaur"
cask "netnewswire"
cask "openaudible"
cask "otto-matic"
cask "plex"
cask "r"
cask "raspberry-pi-imager"
cask "rstudio"
cask "sf-symbols"
cask "visual-studio-code"
cask "vlc"
mas "Apple Configurator", id: 1037126344
mas "AudioBookBinder", id: 413969927
mas "BetterSnapTool", id: 417375580
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Logic Pro", id: 634148309
mas "Numbers", id: 409203825
mas "PDFOutliner", id: 420874236
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "WireGuard", id: 1451685025
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
# Bricklink Studio (available, but cask doesn't work on Apple Silicon)
# Dorico 3.5.app
# NotePerformer
